### KONFIGURASI DYNAMIC AUTONOMOUS ###
(awal colok serial di physical router dan pake serial kabel di 0/1/0)

## Config Router15.1 ##
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R-15.1
R-15.1(config)#interface serial 0/1/0
R-15.1(config-if)#ip address 200.200.200.1 255.255.255.0
R-15.1(config-if)#clock rate 9600
R-15.1(config-if)#no shutdown
R-15.1(config-if)#exit
R-15.1(config)#interface gigabitEthernet 0/0/0
R-15.1(config-if)#ip address 10.10.10.100 255.255.255.0
R-15.1(config-if)#no shutdown
R-15.1(config-if)#exit
R-15.1(config)#interface gigabitEthernet 0/0/1
R-15.1(config-if)#ip address 11.11.11.100 255.255.255.0
R-15.1(config-if)#no shutdown
R-15.1(config-if)#exit

## Setting auto dhcp network router 1##
R-15.1(config)#ip dhcp pool SW-1.1
R-15.1(dhcp-config)#network 10.10.10.0 255.255.255.0
R-15.1(dhcp-config)#default-router 10.10.10.100
R-15.1(dhcp-config)#exit
R-15.1(config)#ip dhcp pool SW-1.2
R-15.1(dhcp-config)#network 11.11.11.0 255.255.255.0
R-15.1(dhcp-config)#default-router 11.11.11.100
R-15.1(dhcp-config)#exit
R-15.1(config)#do w


## Routing ip address di router 1 dengan OSPF##
R-15.1(config)#router ospf 1
R-15.1(config-router)#network 200.200.200.0 0.0.0.255 area 0
R-15.1(config-router)#network 10.10.10.0 0.0.0.255 area 0
R-15.1(config-router)#network 11.11.11.0 0.0.0.255 area 0
R-15.1(config-router)#log-adjacency-changes
R-15.1(config-router)#exit
R-15.1(config)#do w
R-15.1(config)#do sh run

## Config Router15.2 ##
Router>en
Router#conf t
Router(config)#hostname R-GEL15.2
R-GEL15.2(config)#interface serial 0/1/0
R-GEL15.2(config-if)#no shutdown
R-GEL15.2(config-if)#ip address 200.200.200.2 255.255.255.0
R-GEL15.2(config-if)#clock rate 9600
R-GEL15.2(config-if)#exit
R-GEL15.2(config)#interface gigabitEthernet 0/0/0
R-GEL15.2(config-if)#ip address 12.12.12.100 255.255.255.0
R-GEL15.2(config-if)#no shutdown
R-GEL15.2(config-if)#exit
R-GEL15.2(config)#interface gigabitEthernet 0/0/1
R-GEL15.2(config-if)#ip address 13.13.13.100 255.255.255.0
R-GEL15.2(config-if)#no shutdown
R-GEL15.2(config-if)#exit

## Setting auto dhcp network router 2##
R-GEL15.2(config)#ip dhcp pool SW-2.1
R-GEL15.2(dhcp-config)#network 12.12.12.0 255.255.255.0
R-GEL15.2(dhcp-config)#default-router 12.12.12.100
R-GEL15.2(dhcp-config)#exit
R-GEL15.2(config)#ip dhcp pool SW-2.2
R-GEL15.2(dhcp-config)#network 13.13.13.0 255.255.255.0
R-GEL15.2(dhcp-config)#default-router 13.13.13.100
R-GEL15.2(dhcp-config)#exit
R-GEL15.2(config)#do w


## Routing ip address di router 2 dengan OSPF##
R-GEL15.2(config)#router ospf 1
R-GEL15.2(config-router)#network 200.200.200.0 0.0.0.255 area 0
R-GEL15.2(config-router)#network 12.12.12.0 0.0.0.255 area 1
R-GEL15.2(config-router)#network 13.13.13.0 0.0.0.255 area 1
R-GEL15.2(config-router)#log-adjacency-changes
R-GEL15.2(config-router)#exit
R-GEL15.2(config)#do w

Note : 
## R-GEL15.2(config-router)#log-adjacency-changes digunakan untuk menyimpan perubahan ip yang sudah di convert dari subnet yg awalnya 255.255.255.0 jadi 0.0.0.255 karena kebalikannya dari subnet yg 11111111.11111111.11111111.00000000 menjadi 00000000.00000000.00000000.11111111

## Kalo pake serial kabel wajib di clockrate dulu routernya (standarnya 9600)

## perintah R-GEL15.1(config)#do w untuk menyimpan config router

## R-GEL15.1(dhcp-config)# no network 192.192.192.0 255.255.255.0 untuk menghapus network yang di tuju ketika salah pengetikan di dalam config dhcp pool, kemudian bisa masukan lagi network 192.192.192.0 255.255.255.0

## R-GEL15.2(config)#do show run untuk mengecek apakah sudah masuk networknya beserta penjelasannya